app/Controllers/Berkas.php

    public function index()
    {
        $berkas = new BerkasModel();
        $data['berkas'] = $berkas->findAll();
---
SELECT *
FROM `berkas`