app/Controllers/Berkasmhs.php

SELECT *
FROM `berkas`
---
    public function check()
    {
        $berkas = new BerkasModel();
        $data['berkas'] = $berkas->findAll();