app/Models/AdminModel.php

SELECT *
FROM `admin`
WHERE `username` = 'admin'
OR `email` = 'admin'
---
    public function getData($parameter)
    {
        $builder = $this->table($this->table);
        $builder->where('username=', $parameter);
        $builder->orWhere('email=', $parameter);
        $query = $builder->get();